app/controllers/favs_controller.rb

  def index
    render json: Fav.find_by(user_id: params[:user_id])
---
SELECT  "favs".* FROM "favs" WHERE "favs"."user_id" IS NULL LIMIT 1