app/controllers/markers_controller.rb

SELECT "markers".* FROM "markers"
---
  def index
    markers = Marker.all

INSERT INTO "markers" ("name", "latitude", "longitude", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "favs" ("marker_id", "faved", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["marker_id", 2], ["faved", "f"], ["user_id", 4], ["created_at", "2016-01-05 15:14:09.783101"], ["updated_at", "2016-01-05 15:14:09.783101"]]
---
  def create
    marker = Marker.new(name: params[:name], latitude: params[:latitude], longitude: params[:longitude], description: params[:description], user_id: current_user.id)

    if marker.save
      render json: marker
      current_user.favs.create(marker_id: marker.id, faved: 0)